{
    "is_complete": true,
    "username": "FaddisZach",
    "retweeted": {
        "1089304182140665857": {
            "id": "1089304182140665857",
            "text": "Various media outlets and their associated biases.\n\n“It's Dangerous to Go Alone! Take This!”pic.twitter.com/CqPsnjnZst",
            "username": "DanielMiessler",
            "num_likes": 48,
            "num_retweets": 19,
            "num_replies": 7
        }
    },
    "tweeted": {
        "1112440224146227202": {
            "id": "1112440224146227202",
            "text": "There is something about writing the statement 'import time' that makes me feel  supremely powerful. \n\nThousands of programmers have spent countless hours abstracting the complexities of time such that now I can just import a library and leverage…https://refactorcamp.org/@zacharius/101846967219501229 …",
            "username": "FaddisZach",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1100247711838887936": {
            "id": "1100247711838887936",
            "text": "When a significant fraction of a group of people you care about are a part of an economic category which didn't exist 5 years ago and which our current legal fictions do not offer adequate protections for. Feels like the future slammed into me all at…https://refactorcamp.org/@zacharius/101656455961637462 …",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1100247427850878976": {
            "id": "1100247427850878976",
            "text": "Most people here have a general understanding that software is eating the world. But there is a difference between knowing something intellectually and being struck in the face by it.",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1100245457740062720": {
            "id": "1100245457740062720",
            "text": "Recently spent a weekend camping with a group of friends I mostly hadnt seen since college. They were all generally outdoorsy, blue collar type folks. I was the only person there that worked in tech, to my knowledge at least.\n\nI was surprised…https://refactorcamp.org/@zacharius/101656423973562470 …",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1092558787129626625": {
            "id": "1092558787129626625",
            "text": "I think the lesson here for me is that not every convo is for learning or novelty. Sometimes its just about slowly building connections and relationships, laying another social brick. Especially with new relationships, often the convo will be simple.",
            "username": "FaddisZach",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1092557564439642113": {
            "id": "1092557564439642113",
            "text": "There's a girl at my gym that comes at about the same time as me and everyone seems to know her. I admire and envy the little community of friends she has built around her daily gym routine. On the other hand a lot of the small talk she has seems banal to me.",
            "username": "FaddisZach",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1090818125279436800": {
            "id": "1090818125279436800",
            "text": "It's finally happened. Im creating something that I think might be worth giving a license. Now I just need to figure out which. My heart says GPL but tbh I don't really know what the alternatives are.",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1090102655005929472": {
            "id": "1090102655005929472",
            "text": "Also if your active on both sites, you should follow me at\n\nmastodon: zacharius@refactorcamp.org \ntwitter: faddisZach@refactorcamp.org",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1090102048295714816": {
            "id": "1090102048295714816",
            "text": "One word of caution. If you decide to use it please be active on both sites. If your just constantly posting into the void without ever interacting then why are you even here man?",
            "username": "FaddisZach",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1090101667108917249": {
            "id": "1090101667108917249",
            "text": "I was thinking about making a mastodon-twitter crossposter when I came across this.\nhttps://crossposter.masto.donte.com.br/user/advanced_mastodon …\n\nIts much better and easier to use than anything I would've made. \n\nBeen using it for about a week and I'd say its been a success.",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1090099809351094278": {
            "id": "1090099809351094278",
            "text": "Definitely not the most secure but this could be a quickly implemented stop gap measure until we switch to a reasonable system with cryptographic keys and public ledgers.",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1090099808688328704": {
            "id": "1090099808688328704",
            "text": "I trust a credit statement to tell me that a person was at a place and did a thing much more than an illegible scribble on a paper.",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1090099807845343232": {
            "id": "1090099807845343232",
            "text": "Business Idea: Set up a system to sign legal documents by making small credit card transactions. \n\nCredit cards are about he only thing most people have on them at all times, has ok security features, and a global processing system.",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 2
        },
        "1089419120234414081": {
            "id": "1089419120234414081",
            "text": "2/But do the people actually living it know and feel this? Or is it historical and emotional weight that society adds post hoc I'm imaging? Does a zeitgeist exist in the moment or is it something we stitch together afterwards to make a coherent narrative out of history?",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1089418266207010816": {
            "id": "1089418266207010816",
            "text": "1/I look at historical events like MLK's I have a dream speech and Woodstock and think to myself what it must have felt like to be involved. To know that the cultural zeitgeist is alive and flowing through me.",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1089229811975884803": {
            "id": "1089229811975884803",
            "text": "If anyone has comments, questions, or similar projects to show me, that would be greatly appreciated. I havent shown this to many people yet and many details still need to be fleshed out",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1089229538771509248": {
            "id": "1089229538771509248",
            "text": "More detailed description of project can be found herehttps://github.com/Zacharius/Home/blob/master/spec.org …",
            "username": "FaddisZach",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1089228150951854083": {
            "id": "1089228150951854083",
            "text": "My current personal project is making a system for the shared use and ownership of a physical item, in particular housing. It is being written in Solidity and will run on the Ethereum network. \n\nThere are lots of projects/companies working on fractional…https://refactorcamp.org/@zacharius/101484278611554756 …",
            "username": "FaddisZach",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 2
        }
    },
    "num_retweets_by_originator": {
        "DanielMiessler": 1
    },
    "users_retweeted": [
        "DanielMiessler"
    ]
}