{"not_retweeted": {}, "retweeted": {}, "in_network": false, "tweeted": {"1122678557153558529": {"text": "So now, less than five years later, you can go up on a steep hill in Las Vegas and look West, and with the right kind of eyes you can almost see the high-water mark--the place where the wave finally broke and rolled back.", "num_replies": 7, "id": "1122678557153558529", "num_retweets": 144, "num_likes": 513, "username": "GonzoVice"}, "1120414380183752706": {"text": "Let there be no mistake in the history books about that. Richard Nixon was an evil man -- evil in a way that only those who believe in the physical reality of the Devil can understand it. He was utterly without ethics or morals or any bedrock sense of decency.", "num_replies": 4, "id": "1120414380183752706", "num_retweets": 29, "num_likes": 102, "username": "GonzoVice"}, "1120394899298443264": {"text": "If the right people had been in charge of Nixon's funeral, his casket would have been launched into one of those open-sewage canals that empty into the ocean just south of Los Angeles. He was a swine of a man and a jabbering dupe of a president.", "num_replies": 5, "id": "1120394899298443264", "num_retweets": 41, "num_likes": 120, "username": "GonzoVice"}, "1120414638926069762": {"text": "Nobody trusted him -- except maybe the Stalinist Chinese, and honest historians will remember him mainly as a rat who kept scrambling to get back on the ship.", "num_replies": 0, "id": "1120414638926069762", "num_retweets": 8, "num_likes": 37, "username": "GonzoVice"}, "1120514800260460545": {"text": "By disgracing and degrading the Presidency of the United States, by fleeing the White House like a diseased cur, Richard Nixon broke the heart of the American Dream.", "num_replies": 0, "id": "1120514800260460545", "num_retweets": 21, "num_likes": 117, "username": "GonzoVice"}, "1122678478112002048": {"text": "We had all the momentum; we were riding the crest of a high and beautiful wave.", "num_replies": 2, "id": "1122678478112002048", "num_retweets": 74, "num_likes": 231, "username": "GonzoVice"}, "1120531420764692480": {"text": "Too weird to live, too rare to die.", "num_replies": 9, "id": "1120531420764692480", "num_retweets": 352, "num_likes": 895, "username": "GonzoVice"}, "1121094116379639809": {"text": "This is a dangerous notion, and very few professional journalists will endorse it — calling it \"vengeful\" and \"primitive\" and \"perverse\" regardless of how often they might do the same thing themselves. \"That kind of stuff is opinion,\" they say, \"and the reader is cheated.”", "num_replies": 2, "id": "1121094116379639809", "num_retweets": 16, "num_likes": 36, "username": "GonzoVice"}, "1121157889585029122": {"text": "https://www.steadmanclassics.com/collections/frontpage/products/ralph-steadman-signed-richard-nixon-and-agnew-print …", "num_replies": 0, "id": "1121157889585029122", "num_retweets": 13, "num_likes": 26, "username": "GonzoVice"}, "1121841886128476160": {"text": "It is not necessary to accept the choices handed down to you by life as you know it.", "num_replies": 3, "id": "1121841886128476160", "num_retweets": 176, "num_likes": 406, "username": "GonzoVice"}, "1120395430074908672": {"text": "Nixon was so crooked that he needed servants to help him screw his pants on every morning. Even his funeral was illegal. He was queer in the deepest way. His body should have been burned in a trash bin.", "num_replies": 4, "id": "1120395430074908672", "num_retweets": 38, "num_likes": 148, "username": "GonzoVice"}, "1120531048473989120": {"text": "The tragedy of all this is that George McGovern, for all his mistakes… understands what a fantastic monument to all the best instincts of the human race this country might have been, if we could have kept it out of the hands of greedy little hustlers like Richard Nixon.pic.twitter.com/Fx7o353jd2", "num_replies": 0, "id": "1120531048473989120", "num_retweets": 40, "num_likes": 130, "username": "GonzoVice"}, "1121094883622772736": {"text": "Well, maybe so. Maybe Tom Paine cheated his readers and Mark Twain was a devious fraud with no morals at all who used journalism for his own foul ends. And maybe H.L. Mencken should have been locked up for trying to pass off his opinions on gullible readers & normal \"journalism.\"", "num_replies": 0, "id": "1121094883622772736", "num_retweets": 11, "num_likes": 25, "username": "GonzoVice"}, "1120514694740086784": {"text": "Nixon will be remembered as a classic case of a smart man shitting in his own nest. But he also shit in our nests, and that was the crime that history will burn on his memory like a brand.", "num_replies": 2, "id": "1120514694740086784", "num_retweets": 14, "num_likes": 87, "username": "GonzoVice"}, "1121468431482724353": {"text": "In retrospect, it is a harsh and painful life, punctuated every once in a while with moments of staggering beauty and wild adventure.", "num_replies": 1, "id": "1121468431482724353", "num_retweets": 264, "num_likes": 580, "username": "GonzoVice"}, "1122678257667715072": {"text": "And that, I think, was the handle--that sense of inevitable victory over the forces of Old and Evil. Not in any mean or military sense; we didn't need that. Our energy would simply prevail. There was no point in fighting--on our side or theirs.", "num_replies": 0, "id": "1122678257667715072", "num_retweets": 36, "num_likes": 111, "username": "GonzoVice"}, "796179407186624516": {"text": "In a democracy, people usually get the kind of government they deserve.", "num_replies": 80, "id": "796179407186624516", "num_retweets": 2020, "num_likes": 3118, "username": "GonzoVice"}, "1121093801420914688": {"text": "There are a lot of ways to practice the art of journalism, and one of them is to use your art like a hammer to destroy the right people — who are almost always your enemies, for one reason or another, and who usually deserve to be crippled, because they are wrong.", "num_replies": 4, "id": "1121093801420914688", "num_retweets": 71, "num_likes": 206, "username": "GonzoVice"}, "1121095266914979840": {"text": "In my case, using what politely might be called \"advocacy journalism,\" I've used reporting as a weapon to affect political situations that bear down on my environment.", "num_replies": 1, "id": "1121095266914979840", "num_retweets": 18, "num_likes": 43, "username": "GonzoVice"}, "1120413115236192257": {"text": "I have written worse things about Nixon, many times, and the record will show that I kicked him repeatedly long before he went down. I beat him like a mad dog with mange every time I got a chance, and I am proud of it. He was scum.", "num_replies": 5, "id": "1120413115236192257", "num_retweets": 46, "num_likes": 207, "username": "GonzoVice"}, "1121095083686756352": {"text": "Mencken understood that politics — as used in journalism — was the art of controlling his environment, and he made no apologies for it.", "num_replies": 0, "id": "1121095083686756352", "num_retweets": 12, "num_likes": 32, "username": "GonzoVice"}}, "num_retweets_by_originator": {}, "username": "GonzoVice", "users_retweeted": []}