{
    "is_complete": true,
    "username": "kylecyuan",
    "retweeted": {
        "996139013584113671": {
            "id": "996139013584113671",
            "text": "Chilling at @Balance_io proofing blog post for tomorrow!\n\nThanks @ricburton this has been super chill home base for the day!https://twitter.com/lrettig/status/996102418176921600 …",
            "username": "mattdlockyer",
            "num_likes": 1,
            "num_retweets": 1,
            "num_replies": 0
        }
    },
    "tweeted": {
        "1036461380449103872": {
            "id": "1036461380449103872",
            "text": "1/ Many should exercise more caution in predicting China's future. Those overly attribute short-term market opportunity for innovation ability. They also omit serious macro factors and structural concerns. It's a \"treadmill to hell\" and \"Gravity will not be repealed.\"",
            "username": "kylecyuan",
            "num_likes": 1242,
            "num_retweets": 292,
            "num_replies": 33
        },
        "1116793001706082304": {
            "id": "1116793001706082304",
            "text": "It comes down to whether a startup can build a distribution engine before an incumbent innovates. Startups have a comparative advantage to do this with good ideas that look like bad ideas. However, with good ideas that look like good ideas, incumbents win.",
            "username": "kylecyuan",
            "num_likes": 27,
            "num_retweets": 4,
            "num_replies": 2
        },
        "1123763634851729409": {
            "id": "1123763634851729409",
            "text": "5/ Most VCs are usually decent at evaluating opportunities on a relative basis, but poor at evaluating opportunities on an absolute one. The greatest investors, irrespective of age, don't rely on pattern recognition or signal from others but anchor themselves to first-principles.",
            "username": "kylecyuan",
            "num_likes": 83,
            "num_retweets": 11,
            "num_replies": 0
        },
        "1123763633551544320": {
            "id": "1123763633551544320",
            "text": "4/ In markets like healthcare that can yield businesses with attractive multiples, but posit new challenges given their barriers of entry and capital intensiveness, these VCs will add a word like \"managed\" to \"marketplace,\" latching onto the grammars of previous business models.",
            "username": "kylecyuan",
            "num_likes": 21,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1123763631857049607": {
            "id": "1123763631857049607",
            "text": "3/ The physics and underlying structural economics of SaaS are not similar to IoT & Biotech—markets which lack the development cycles, distribution models, and margins that create 10x+ revenue valuations. Software is eating the world, but not all software opportunities are equal.",
            "username": "kylecyuan",
            "num_likes": 29,
            "num_retweets": 4,
            "num_replies": 2
        },
        "1123763630820999169": {
            "id": "1123763630820999169",
            "text": "2/ These VCs are applying the Web 2.0 paradigm of innovation to Web 3.0 governance. Cryptocurrencies are money, not equity. Cryptonetworks are a new technology to expand the possibilities of economic coordination and programmable trust on the web; they are not startups.",
            "username": "kylecyuan",
            "num_likes": 34,
            "num_retweets": 9,
            "num_replies": 3
        },
        "1123763629839482880": {
            "id": "1123763629839482880",
            "text": "1/ Many VCs who were successful in pre-2010 vintages with one vertical are applying their playbook to new verticals with radically different market structures and operating dynamics. This is evident in how they are evaluating cryptonetworks, Biotech, IoT, and high touch markets.",
            "username": "kylecyuan",
            "num_likes": 120,
            "num_retweets": 18,
            "num_replies": 4
        },
        "1101574587123490816": {
            "id": "1101574587123490816",
            "text": "QE is a proximate cause of millennial socialism. The root cause is stagnating technological progress in slow sectors of the economy, which has led to broad stagnation and wages since 1973. In turn, this led to excessive leverage and dependency on Keynesianism to steer our future.",
            "username": "kylecyuan",
            "num_likes": 13,
            "num_retweets": 3,
            "num_replies": 2
        },
        "1113646641486102533": {
            "id": "1113646641486102533",
            "text": "Blackrock's exotic ETFs definitely contain explosive risk. Furthermore, the products that are transparent & for exposure may appear liquid, but underneath filled with high-yield debt, EM debt, & illiquid securities. There's a narrative mirage around \"it's Blackrock\" so buy.",
            "username": "kylecyuan",
            "num_likes": 16,
            "num_retweets": 2,
            "num_replies": 1
        },
        "1113657282158649344": {
            "id": "1113657282158649344",
            "text": "Ratchets, PIK dividends, liquidity rights, series-based M&A vetoes & superior preferences are part of Softbank's collateral? So, illiquidity premium & price inflation is core to their business model. Instead of funding the factory of the future, Softbank is funding a CLO factory.",
            "username": "kylecyuan",
            "num_likes": 8,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1117270102976737280": {
            "id": "1117270102976737280",
            "text": "What’s not included here-QE inflated asset prices penalizing the young, but it also taxed pension funds by pushing fixed income yields down (which most pension funds are tilted) & forcing them to gamble on equities to address liabilities, which they can’t.https://www.wsj.com/articles/why-the-longest-u-s-bull-market-has-failed-to-fix-the-nations-public-pensions-11554888600 …",
            "username": "kylecyuan",
            "num_likes": 4,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1116790165664489472": {
            "id": "1116790165664489472",
            "text": "*reading $UBER S1:\n\n\"We have incurred significant losses since inception, including in the United States and other major markets. We expect our operating expenses to increase significantly in the foreseeable future, and we may not achieve profitability.\" \n\n*weird flex, but ok.",
            "username": "kylecyuan",
            "num_likes": 11,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1114991505675042817": {
            "id": "1114991505675042817",
            "text": "With DVNBs, the friction of the incumbent channel, why the new customer experience is orders of magnitude better than the previous one, and the margin structure & buying behavior of the product are the three primary leading indicators to predict the success of a consumer brand.https://twitter.com/kylecyuan/status/1060294086769500161 …",
            "username": "kylecyuan",
            "num_likes": 6,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1114774709676183552": {
            "id": "1114774709676183552",
            "text": "Growth hacking has evolved in an unhealthy way where the core attributes of enduring companies are neglected. Seed startups should aim to hack value before they hack growth. Organic users are a company’s biggest asset moving forward where distribution is a moat that only widens.",
            "username": "kylecyuan",
            "num_likes": 45,
            "num_retweets": 7,
            "num_replies": 1
        },
        "1114774708791185409": {
            "id": "1114774708791185409",
            "text": "A fantastic & differentiated user experience provides more leverage than artificial spend. If you're dependent on artificial spend, you haven't built a killer product & amplifying churn in the process to grow linearly (instead of exponentially) on an absolute dollar amount basis.",
            "username": "kylecyuan",
            "num_likes": 24,
            "num_retweets": 6,
            "num_replies": 1
        },
        "1114774707642011653": {
            "id": "1114774707642011653",
            "text": "Many startups justify high CAC costs from their LTV model. \"If one asserts that buying customers below what they charge them is a corporate strategy, this is an arbitrage game [that] rarely last[s].\"- @bgurley. LTV model is not always accurate & its variables are interdependent.",
            "username": "kylecyuan",
            "num_likes": 95,
            "num_retweets": 15,
            "num_replies": 4
        },
        "1113176131669254145": {
            "id": "1113176131669254145",
            "text": "Curious to see how consumer brands leverage Mobile AR. With the existing install base, Mobile AR is a new channel & platform to craft & gamify the customer relationship. CPG products with 100% churn & low-frequency of purchase now can offer robust customer lifetime value.",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 2,
            "num_replies": 0
        },
        "1113174779987673088": {
            "id": "1113174779987673088",
            "text": "The massive capital inflows in p/e for high-growth startups from Softbank, crossovers, & corporates parallels that of actively managed funds in public markets. Alpha becomes negative as a result of passive penetration. So, more funds are finding ways to double down on active.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1113174779115208707": {
            "id": "1113174779115208707",
            "text": "\"VC economics with public market liquidity\" offered by crypto is fascinating. There is a lot to unpack here.\n\nEliminating liquidity risk creates an entirely new return profile for the asset class & what absolute return means. Many of these funds will transition to Activism & ESG.https://twitter.com/alexrkonrad/status/1113081602513530881 …",
            "username": "kylecyuan",
            "num_likes": 7,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1103888586422726656": {
            "id": "1103888586422726656",
            "text": "When abnormal policy unwinds, the bad LPs who failed to downsize or insulate properly will need to firesale on the secondary market. There is a hysteresis with VC performance (10-year asset class); new GPs with unrealized returns will need to deal with their bad LP’s illiquidity.",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1103888583591526400": {
            "id": "1103888583591526400",
            "text": "Post-2008 interest rate environment and institutions thirsty for yield have produced record dry powder for VCs (and QE is responsible for many #litquidity events). With the euphoria behind the reverse denominator effect, most new GPs aren't selective enough about their LPs.https://twitter.com/DavidSacks/status/1103377624909283330 …",
            "username": "kylecyuan",
            "num_likes": 6,
            "num_retweets": 2,
            "num_replies": 1
        },
        "1096817449553612800": {
            "id": "1096817449553612800",
            "text": "Many cite how George Soros and Seth Klarman purchased $TSLA shares last year. However, they bought $TSLA convertible bonds. It's a flavor of converible arbitrage to enhance income and hedge against equity market risk. It also is a hedge against a large short position as well.",
            "username": "kylecyuan",
            "num_likes": 9,
            "num_retweets": 3,
            "num_replies": 1
        },
        "1099788537908658176": {
            "id": "1099788537908658176",
            "text": "The generational transition in venture capital is very real and brutal. The majority of the top engineering and product talent around 30 (+/- 5) I have spoken with are generally skeptical and annoyed by legacy firms and partners.",
            "username": "kylecyuan",
            "num_likes": 17,
            "num_retweets": 2,
            "num_replies": 0
        },
        "1099506392128540672": {
            "id": "1099506392128540672",
            "text": "The user culture, interface, and ergonomics of the @SuperhumanCo product is tremendous. I wish I was an investor. \n\nIt speaks volumes that I have reached inbox zero on @SuperhumanCo but still have 131 text messages to deal with on iMessage. \n\nKeep up the great work @rahulvohra!pic.twitter.com/JrrJdLBJDa",
            "username": "kylecyuan",
            "num_likes": 26,
            "num_retweets": 2,
            "num_replies": 2
        },
        "1098093138357485568": {
            "id": "1098093138357485568",
            "text": "I’m definitely not against more vanilla derivative products on the blockchain. However, I’m vehemently against a sinister form of iatrogenesis where exotic, dangerous derivatives practices can hide behind the banners of financial innovation and technological progress.",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1098093136847519744": {
            "id": "1098093136847519744",
            "text": "With derivatives, if the underlying assets have mild fat tails, then the derivative will produce fatter tails. Credit Default Swaps exert too much downward pressure on the underlying bond and can be traded. With the blockchain, these transactions would be immutable and automated!",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1098093135622742018": {
            "id": "1098093135622742018",
            "text": "New technologies have often amplified bad trading practices: Long-Term Capital Management, Quant Quake, and 2008. The opaque, complex, and leveraged bilateral OTC trades that caused 2008 were uniquely enabled by decentralizing regulatory authority.",
            "username": "kylecyuan",
            "num_likes": 4,
            "num_retweets": 1,
            "num_replies": 8
        },
        "1098093133227794434": {
            "id": "1098093133227794434",
            "text": "Blockchains excel at automating a derivative trade in a trustless manner, but they are not clearinghouses. Clearinghouses prevent the risk of default by market participants. They also improve liquidity in certain high-volume and standardized tractions via novation and collateral.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1098093132024111104": {
            "id": "1098093132024111104",
            "text": "This is iatrogenesis. While the transparency and automation properties of derivative markets on the blockchain are appealing, they are offset by systemic risks. The issue with CDS is not trust, but dangerous and reflexive risk/reward distortions.https://link.medium.com/HyxW0Bk9rU ",
            "username": "kylecyuan",
            "num_likes": 8,
            "num_retweets": 1,
            "num_replies": 2
        },
        "1096270346200731648": {
            "id": "1096270346200731648",
            "text": "Today, New York lost:\n\n- $27.5 bn. in tax revenue\n- $2.5bn. in investment\n- $5 million in workforce development\n- 25,000 high-paying jobs (up to 40,000)\n- 1,300 construction jobs\n- 107,000 direct/indirect jobs\n- Amazon HQ Incubator\n\n\"Men lie, women lie, numbers don't\"-Jay-Z",
            "username": "kylecyuan",
            "num_likes": 95,
            "num_retweets": 24,
            "num_replies": 8
        },
        "1078756158364635141": {
            "id": "1078756158364635141",
            "text": "Saying yes to everything is a quick road to mediocrity.",
            "username": "kylecyuan",
            "num_likes": 158,
            "num_retweets": 41,
            "num_replies": 1
        },
        "1060377029282066432": {
            "id": "1060377029282066432",
            "text": "5/ Bio is the intersection of atoms and bits. Early engineering bio of today resembles internet portals of the past. For the past forty years, we have been transitioning to an era of sustainability, dematerialization, and democratized value creation.",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1060377028480983040": {
            "id": "1060377028480983040",
            "text": "4/ Our world sits at an inflection point with the environment and markets. The need for \"smart green growth\" is urgent over the backdrop of intense global populism. In other words, there are converging, hard problems in the environment and markets today that require addressing.",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1060377027805614087": {
            "id": "1060377027805614087",
            "text": "3/ Biology is the original IT.\nCells are hardware.\nDNA is software.\n\nBiological evolution has to do with environmental conditions.\nHuman evolution has to do with market conditions.",
            "username": "kylecyuan",
            "num_likes": 13,
            "num_retweets": 2,
            "num_replies": 1
        },
        "1060377026337628160": {
            "id": "1060377026337628160",
            "text": "2/ Many have short-term time horizons with new technologies (Blockchain Frenzy). Bio investing is the actual time arbitrage play with tremendous social and economic outcomes.https://twitter.com/kylecyuan/status/1058255394634485760 …",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1060377025494560768": {
            "id": "1060377025494560768",
            "text": "1/ We are at the Information Age but have yet to reach the Age of Understanding. @pmacrca 's Why Software is Eating the World the bridge to \"Why Bio is Eating the World.\"",
            "username": "kylecyuan",
            "num_likes": 33,
            "num_retweets": 8,
            "num_replies": 1
        },
        "1060373371773317120": {
            "id": "1060373371773317120",
            "text": "Working is a comparative advantage most when other people aren't—or can't. There is less competition from incumbents for hires and to close competitive startups mid-fundraise on holidays. I benefited from this during the summer where almost everybody but founders are on vacation.",
            "username": "kylecyuan",
            "num_likes": 12,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1060373370120871938": {
            "id": "1060373370120871938",
            "text": "I learned from @Rabois to hire undiscovered talent. Founders should view investors similarly. Xmas (+summer) are holidays for large funds and co's. The undiscovered are hiring + investing. \n\n\"It doesn't matter if you're a lion or gazelle when the sun rises you better be running.\"https://twitter.com/ryan_caldbeck/status/1059618888701292545 …",
            "username": "kylecyuan",
            "num_likes": 19,
            "num_retweets": 2,
            "num_replies": 0
        },
        "1060294404408307712": {
            "id": "1060294404408307712",
            "text": "With technological innovations, the initiator, not the follower definitely bear the risk. But with business innovations, the initiator, not the follower definitely bear the fruits.\n\nThis is my summary of the history of disruptive innovation and the first mover-disadvantage.",
            "username": "kylecyuan",
            "num_likes": 9,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1060294097158602752": {
            "id": "1060294097158602752",
            "text": "9/ Brand marketing is leverage and an amplifier effect. If you have a bad product with high churn, and you scale with brand marketing, your amplifying churn.\n\nBusinesses are not a monolith. \n\ne.g., @scottbelsky 's on most business advice: “I won the lottery. Go play my numbers.”",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1060294093849485318": {
            "id": "1060294093849485318",
            "text": "7/ Founders overestimate branding because of the Funnel Metaphor. Funnels are an industrial, linear push strategy.\n\nNot the 1800s anymore. There are networks, new touch-points, and product dev strategies that can pull versus push.\n\nIt's about mastering liquidity in distribution.",
            "username": "kylecyuan",
            "num_likes": 6,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1060294092586926081": {
            "id": "1060294092586926081",
            "text": "6/ Successful investment in brand yields returns expressed via a business' ability to command pricing power and frequency of purchase over customers against adjacent competitors.\n\nHowever, brand effects take time.\n\nCoca-Cola has a brand. Your startup doesn't.",
            "username": "kylecyuan",
            "num_likes": 6,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1060294091890667521": {
            "id": "1060294091890667521",
            "text": "5/ When the costs of building brands (such as high spend), outweigh the benefits, the purpose of a brand is useless. \n\nArtificial growth is not fooling anyone! \n\nMy favorite line is from @mattcohler: \"averages always lie.\" This is especially true for marketplace businesses.",
            "username": "kylecyuan",
            "num_likes": 4,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1060294089810329601": {
            "id": "1060294089810329601",
            "text": "4/ My operating definition of a brand:\n\nBranding is a set of strategies and tactics for a company with the goal to erect a competitive advantage in sustaining long-term profits, generating growth, and defending market share.",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1060294088602329088": {
            "id": "1060294088602329088",
            "text": "3/ Many consumer founders pursue brand effects thinking they are the same as network effects. However, one is more sustainable and stickier than the other.\n\nThe brand is merely a direct function of a business' strategic profile. \n\nFounders often conflate goals with strategies.",
            "username": "kylecyuan",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1060294086769500161": {
            "id": "1060294086769500161",
            "text": "1/ Branding is a highly coveted, yet elusive advantage for most early-stage startups.\n\nFor founders of early-stage consumer startups,\n\nInstead of asking what's the purpose of a brand?\n\nAlways ask,\n\nWhy does your brand even exist?",
            "username": "kylecyuan",
            "num_likes": 38,
            "num_retweets": 5,
            "num_replies": 1
        },
        "1058964426349559808": {
            "id": "1058964426349559808",
            "text": "$BTC did not raise any capital. That's an underrated fact.",
            "username": "kylecyuan",
            "num_likes": 15,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1058271747294679040": {
            "id": "1058271747294679040",
            "text": "19/ @pmarca predicts \"hundreds of new countries\" in the coming years.\n\n@balajis asked, \"Is the USA Microsoft of Nations?\"\n\nMaybe this whole next \"SV idea\" is really dumb...\n\nOld Chinese Proverb: \"Of all 36 ways to get out of trouble, the best way is—leave.\"",
            "username": "kylecyuan",
            "num_likes": 8,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1058267188807618560": {
            "id": "1058267188807618560",
            "text": "15/ Cities would be SaaS. For example, let's say people in SV are unhappy after having \"voiced\" dissent. They can \"exit\" and create their ideal conditions online—instantly. Our viewpoints on where innovation occurs will change as we develop extranational beliefs of the world.",
            "username": "kylecyuan",
            "num_likes": 10,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1058267186043662337": {
            "id": "1058267186043662337",
            "text": "12/ Where will you start a government business? It's not in SV. Some sectors are best changed in certain locations.\n\nLooking for the \"next SV\" is a bearish outlook on the future of progress. It's a bad 1 to n versus a good 0 to n. \n\nReminds me of @peterthiel and @pmarca debate.",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1058267185187966977": {
            "id": "1058267185187966977",
            "text": "11/ It's all about the people. The smartest founders are deliberate in where they start their companies. They want to give themselves unfair advantages for their idea—and a city's unique, unreplicable infrastructure is one of them.",
            "username": "kylecyuan",
            "num_likes": 9,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1058267183287951361": {
            "id": "1058267183287951361",
            "text": "9/ I remain bullish on why NYC's relevance as a tech hub will skyrocket over the next few years. It aligns well with global trends and the future of how value is created and distributed. It will thrive on the trajectory of the open economy. \n(saving this for a longer post.)",
            "username": "kylecyuan",
            "num_likes": 8,
            "num_retweets": 2,
            "num_replies": 0
        },
        "1058267180423294976": {
            "id": "1058267180423294976",
            "text": "6/ This is not a criticism of SV at all. This is to emphasize that cities trying \"to be the SV\" not only won't but will turn out like \"Uber for X\" startups. They should be focused on what SV hasn't offered or can't offer. This also betters the world and attracts the right people.",
            "username": "kylecyuan",
            "num_likes": 11,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1058267178485465089": {
            "id": "1058267178485465089",
            "text": "5/ This was precisely my criticism with China and its innovation potential. There is something with diversity that creates the entropy for change. From monoculture, China has an edge with incremental innovation. But not truly disruptive ones.https://twitter.com/kylecyuan/status/1036461380449103872?lang=en …",
            "username": "kylecyuan",
            "num_likes": 9,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1058267177680138240": {
            "id": "1058267177680138240",
            "text": "4/ Slightly skeptical on how durable SV's NFX are. SV's genesis was mass-production in goods like Silicon chips after WWII. But a new open economy today create and incentivizes heterogeneity from market diversity. Not homogenous ones. It's a new world and SV knows that.",
            "username": "kylecyuan",
            "num_likes": 6,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1058267176740642816": {
            "id": "1058267176740642816",
            "text": "3/ New York, Seattle, DC, LA, Boston... Hong Kong, Zurich, or Tel Aviv. They all have unique attributes that SV doesn't have. It's interesting to think at least for the media (take it how you will), \"what makes something quintessentially Silicon Valley\" is no longer a compliment.",
            "username": "kylecyuan",
            "num_likes": 6,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1058267175637532673": {
            "id": "1058267175637532673",
            "text": "2/ Globalization is a decentralizing force. It requires local economies to pursue specialized production in remaining competitive and differentiated in the larger market. Countries and cities will succeed by defining an identity.",
            "username": "kylecyuan",
            "num_likes": 13,
            "num_retweets": 2,
            "num_replies": 2
        },
        "1058267173506797568": {
            "id": "1058267173506797568",
            "text": "1/ I'm not a fan of \"the next Silicon Valley (SV)\" idea.  If geographic/brand NFX are permanent moats, SV will be number one forever. So, no next SV. If the future features distributed work and value chains, innovation hubs will be spread out across the world. So, no next SV.",
            "username": "kylecyuan",
            "num_likes": 46,
            "num_retweets": 6,
            "num_replies": 1
        },
        "1058255394634485760": {
            "id": "1058255394634485760",
            "text": "The Internet is a very efficient arbitrage of ideas. Everything has been done. But the Internet is a poor arbitrage of time. People with longer-time horizons and stick to something at an irrational level win. This seems to be true with everything in life. Not just startups.https://twitter.com/justinkan/status/1058173998083653632 …",
            "username": "kylecyuan",
            "num_likes": 31,
            "num_retweets": 3,
            "num_replies": 0
        },
        "1057656708682670081": {
            "id": "1057656708682670081",
            "text": "Every strength has a corresponding weakness. \n\nInteresting that @WSJ continue to emphasize a liquidity premium in going public for @Uber.\n\nHowever, there seems to be a clear \"illiquidity premium\" in staying private. \n\nUber will 100% not enjoy a liquidity premium when they IPO.",
            "username": "kylecyuan",
            "num_likes": 7,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1057655189472231429": {
            "id": "1057655189472231429",
            "text": "3/ Great products first seem unreasonable. But they represent enduring visions of the world. So they finish by inspiring the next generation of products. \n\nThe combination to great products often originates in first principles (physics) AND evolutionary biology (history).",
            "username": "kylecyuan",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1057655187836428288": {
            "id": "1057655187836428288",
            "text": "2/ What makes the best products? They are___\n- useful and elegant.\n- simple and accessible.\n- impactful and differentiated.\n- authentic and responsible.\n- positive-sum and uniting.\n- inspiring and evolutionary.\n\nThey all started with courage and first seemed unreasonable.",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1057655187119263744": {
            "id": "1057655187119263744",
            "text": "1/ We should value and merchandise our ideas and beliefs as products. This creates an idea meritocracy internally for yourself and externally for your relationships. The goal is to weigh precious truths with compelling and clear ROIs.",
            "username": "kylecyuan",
            "num_likes": 4,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1039327146194288640": {
            "id": "1039327146194288640",
            "text": "How to Read\n1. Clarify purpose. \n2. Clear questions.\n3. Filter accurate/relevant information.\n4. Reach logical inferences w/ conclusion.\n5. Identify important/deep concepts.\n6. Distinguish justifiable/unjustifiable assumptions. \n7. Logical implications.\n8. Diverse viewpoints.",
            "username": "kylecyuan",
            "num_likes": 29,
            "num_retweets": 4,
            "num_replies": 1
        },
        "1038993904891117571": {
            "id": "1038993904891117571",
            "text": "Just finished #Blitzscaling by @reidhoffman and @chrisyeh. One of the three books this year that has reinforced my thinking on growth for startups. Fantastic.pic.twitter.com/2GPpeURdkJ",
            "username": "kylecyuan",
            "num_likes": 21,
            "num_retweets": 4,
            "num_replies": 1
        },
        "1037838683678728192": {
            "id": "1037838683678728192",
            "text": "Investing is universal. Of course, nuances exist per asset class, vertical, etc.\n\nAt #Disrupt2018, (most, not all) growth/crypto \"investors\" are trading trends, not investing.\n\nWhy \"trade\" startups?\n\nArbitrage time. \n\nThe mastery of value-timing, not price-timing is valuable.",
            "username": "kylecyuan",
            "num_likes": 13,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1036894877584257025": {
            "id": "1036894877584257025",
            "text": "25/ To clearly and methodically arrive at a contrarian truth and a secret, exploit and act on that truth with courage, knowing failure is likely and prevail—the power of contrarian thinking.",
            "username": "kylecyuan",
            "num_likes": 4,
            "num_retweets": 0,
            "num_replies": 2
        },
        "1036894875675848704": {
            "id": "1036894875675848704",
            "text": "23/ Contrarian anticipations require humility and awareness of the cognitive biases. Heuristics are limited. Contrarian truth in startups is high-latency. There is always the uncontrollable, unknowable, and opaque. The bad left tails.",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1036894872265875456": {
            "id": "1036894872265875456",
            "text": "19/ A Contrarian's heuristic is the Triadic Law:\n\n1. Preliminary Thesis: the prevailing trend and opinion. (Quant or Speculative).\n\n2. Antithesis: a skeptical analysis that negates the entirety of (1) or part of it. \n\n3. Synthesis: The conclusion of the opposing viewpoint.",
            "username": "kylecyuan",
            "num_likes": 7,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1036894861809471489": {
            "id": "1036894861809471489",
            "text": "8/ \"Contrary Thought\" is an \"antidote to general forecasting than a system of forecasting.\" \n\nThe great discontinuities of society are not overnight. \n\nAvoid the ruse of definitive prediction. Be enchanted by the power \"contrary anticipations\" in a world of perpetual change.",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1036894860521824257": {
            "id": "1036894860521824257",
            "text": "7/ \"Les Lois Sociales\" relates to Schumpeterian innovation. Contrarians start a secret truth. They form a conspiracy, which spreads with imitation and contagion to diffuse innovation.\n\nAt scale, leaders lead swarms of imitators to an innovation.",
            "username": "kylecyuan",
            "num_likes": 4,
            "num_retweets": 0,
            "num_replies": 2
        },
        "1036894859708092417": {
            "id": "1036894859708092417",
            "text": "6/ \"The difference between a vision and a hallucination is that other people can see a vision.\" - @pmarca \n\nWith the right judgment, time, and tenacity, the conspiracy spreads.",
            "username": "kylecyuan",
            "num_likes": 6,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1036894858894499842": {
            "id": "1036894858894499842",
            "text": "5/ Contrarianism is a method, not a goal. To source and create opportunities, Contrarians appreciate Tarde's Laws of Imitation. \n\n1. To exploit inefficiencies in markets.\n\n2. To use imitation to lead their crowd: referred to by @peterthiel as the conspiracy.",
            "username": "kylecyuan",
            "num_likes": 8,
            "num_retweets": 2,
            "num_replies": 1
        },
        "1036894857950724096": {
            "id": "1036894857950724096",
            "text": "4/ Gabriel Tarde's Les Lois Sociales: no \"logical separation between voluntary and involuntary imitation exist.\" \n\nImitation and Contagion diffuse beliefs and desires across society: variables endogenous to each other's strength.",
            "username": "kylecyuan",
            "num_likes": 7,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1036894857153789953": {
            "id": "1036894857153789953",
            "text": "3/ Contrarians understand public opinion is inevitable in society and markets. Shaped by beliefs and desire, public opinion follows events, rather than lead it. Public opinions are at the whims of greed, fear, envy, impulsivity, pride, and hope.",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1036894856184979456": {
            "id": "1036894856184979456",
            "text": "2/ Contrarians understand this. Be contrarian. Be right.@reidhoffman \n\nThe Myth: Contrarians are perpetual cynics that disagree for the sake of disagreement. Crowd.\n\nThe Reality: Contrarians are long-term independent thinkers who are humble and courageous. Heroes.",
            "username": "kylecyuan",
            "num_likes": 10,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1036894855425716224": {
            "id": "1036894855425716224",
            "text": "1/ Contrarianism is key to exceptional returns and legacy companies. But it's mistaken for weak converse statements. The crowd overuses it. \n\nAvoid lazy opposites, search for contrarian truths which yield actionable ideas with power.",
            "username": "kylecyuan",
            "num_likes": 43,
            "num_retweets": 8,
            "num_replies": 2
        },
        "1036887244458475522": {
            "id": "1036887244458475522",
            "text": "Before I continue with my daily thread, I just want to recognize and appreciate who shared my thread first. From the comments, I'm glad there was some sort of conversation on China's credit economy and innovation future. Thank you.https://twitter.com/rabois/status/1036467955125501952 …",
            "username": "kylecyuan",
            "num_likes": 12,
            "num_retweets": 1,
            "num_replies": 0
        },
        "1036461404365062144": {
            "id": "1036461404365062144",
            "text": "25/ China has not sustained a significant crisis since 1989.\n\nThe next crisis is not if, but when. \n\nChina has a classic Innovator's Dilemma. What's worked in the past will not work for the future. It needs to cannibalize its strategy and transition.\n\nCan it afford to? Will it?",
            "username": "kylecyuan",
            "num_likes": 166,
            "num_retweets": 26,
            "num_replies": 21
        },
        "1036461403542937601": {
            "id": "1036461403542937601",
            "text": "24/ @wolfejosh and @rabois have noted Chinese opacity in accounting. In an environment of centralized power, homogeneity, excessive debt, leverage dependence and political monoculture, the consequences of opacity exacerbate. Can China's use of leverage be worse?",
            "username": "kylecyuan",
            "num_likes": 73,
            "num_retweets": 10,
            "num_replies": 4
        },
        "1036461402813153280": {
            "id": "1036461402813153280",
            "text": "23/ The absolute size and delta to China's credit are terrifying; its concentrated on the balance sheets of corporate sectors. Given these facts and the lack of optionality, China will, not if, share an outcome like Greece (government debt) or the US (housing market debt).",
            "username": "kylecyuan",
            "num_likes": 71,
            "num_retweets": 9,
            "num_replies": 2
        },
        "1036461402041405440": {
            "id": "1036461402041405440",
            "text": "22/China needs to stabilize and increase direct financing. The reality is excessive leverage, the demographic cliff, and air pollution. Liquidity declines to levels China is unfamiliar. Credit diverts from productivity. \n\nThe point: \n\nChina can run. It cannot hide.",
            "username": "kylecyuan",
            "num_likes": 71,
            "num_retweets": 6,
            "num_replies": 1
        },
        "1036461401185767425": {
            "id": "1036461401185767425",
            "text": "21/ State Controls cannot at all fix the demographic cliff. Their one-child policy will impair labor productivity in China, but also enhance financial fragility as the population ages, pension costs rise, which mean less capital flexibility than China has enjoyed.",
            "username": "kylecyuan",
            "num_likes": 62,
            "num_retweets": 6,
            "num_replies": 1
        },
        "1036461400338493441": {
            "id": "1036461400338493441",
            "text": "20/ While Chinese GDP has grown 12x, it's financial leverage has increased 40x. China's GDP-to-total-debt ratio has grown 4x. China's excessive leverage is carcinogenic and only gets worse. \n\nState Control cannot sustainably address this debt.",
            "username": "kylecyuan",
            "num_likes": 94,
            "num_retweets": 13,
            "num_replies": 2
        },
        "1036461399411576832": {
            "id": "1036461399411576832",
            "text": "19/ There is a distinction between \"average\" and \"median\" household incomes. Wealth is concentrated in the CPC, and there is a wealth gap in China. \"Averages always lie\"- @mattcohler 's view on startups applies here. Excessive leverage also drives the \"great\" market opportunity.",
            "username": "kylecyuan",
            "num_likes": 62,
            "num_retweets": 9,
            "num_replies": 2
        },
        "1036461398316863488": {
            "id": "1036461398316863488",
            "text": "18/ Many highlights China's rising wages, inflation, and low household debt for optimism. Consumers will surpass US retail by 2020! Domestic consumption accounts for 62% of China GDP. This not only skirts structural inquiries but exaggerates outlook on the market opportunity.",
            "username": "kylecyuan",
            "num_likes": 40,
            "num_retweets": 4,
            "num_replies": 1
        },
        "1036461397536731137": {
            "id": "1036461397536731137",
            "text": "17/ All companies must be harmonious with China. CPC communist representation is required in all companies (especially foreign companies like Google). \n\nE.g., a startup need to downsize to innovate, but this weakens Chinese-set productivity targets, will China let them?",
            "username": "kylecyuan",
            "num_likes": 34,
            "num_retweets": 2,
            "num_replies": 2
        },
        "1036461396148412417": {
            "id": "1036461396148412417",
            "text": "16/ @sama astutely noted: \"you can't day trade startups\" when discussing private tech markets with @roelofbotha in the US. Given the serious structural issues put forth and further macro consideration, can this be applied to China?",
            "username": "kylecyuan",
            "num_likes": 38,
            "num_retweets": 4,
            "num_replies": 1
        },
        "1036461395276005378": {
            "id": "1036461395276005378",
            "text": "15/ China's recent claim to open competition and foreign investment show the macro and structure concerns are now more explicit. China has reverted to slow sectors for growth and is a credit economy to boost confidence. China requires CPC influence in all companies in China.",
            "username": "kylecyuan",
            "num_likes": 37,
            "num_retweets": 5,
            "num_replies": 2
        },
        "1036461394474881024": {
            "id": "1036461394474881024",
            "text": "14/ China's acquisition dependency won't drive Chinese hegemony in Frontier Tech. With \"Made in China 2025,\" the reality is all breakthrough tech go through long, high beta cycles (cc Carlota Perez). \n\nCycles invite macro discussion: can China endure for tech cycles to play out?",
            "username": "kylecyuan",
            "num_likes": 43,
            "num_retweets": 3,
            "num_replies": 1
        },
        "1036461392922984448": {
            "id": "1036461392922984448",
            "text": "13/ Why is China's M&A always hot?  China's innovation has been a result of acquisitions. In the 1980s, China M&A'd to enable energy and natural resources. Today, China M&A's for high-tech and brands. \n\nHomogenization creates interdependence, not independence.\n\nLook at #BAT.",
            "username": "kylecyuan",
            "num_likes": 63,
            "num_retweets": 7,
            "num_replies": 2
        },
        "1036461391861796864": {
            "id": "1036461391861796864",
            "text": "12/ Crypto as the next techno-economic paradigm illustrates the antagonism between Conform vs. Confront. \n\n@katherineykwu recently broke the news of Chinese censorship a vaccination scandal on Ethereum. If new tech produces disharmony, censored. No funding can change this.",
            "username": "kylecyuan",
            "num_likes": 58,
            "num_retweets": 7,
            "num_replies": 1
        },
        "1036461390809034752": {
            "id": "1036461390809034752",
            "text": "11/ China is more capitalist than communist. This does not mean China isn't pervasively authoritarian. Bureaucracy is entrenched in social life, education, and the private sector. China's culture of harmony: \n\nConform. Not Confront. \n\nWhen does disruptive innovation conform?",
            "username": "kylecyuan",
            "num_likes": 174,
            "num_retweets": 28,
            "num_replies": 5
        },
        "1036461390016344064": {
            "id": "1036461390016344064",
            "text": "10/ The logic of state control inherently fosters a culture of top-down optimization, which inhibits bottom-up innovation and serendipity. This creates \"arbitrage entrepreneurs,\" not breakthrough ones. Creating the Chinese Google (Baidu) is not akin to creating the next Google.",
            "username": "kylecyuan",
            "num_likes": 268,
            "num_retweets": 39,
            "num_replies": 11
        },
        "1036461389223624706": {
            "id": "1036461389223624706",
            "text": "9/ State Control enable market efficiency, but tradeoffs with innovation. China's success in applying software to consumer-driven models is representative of Schumpeter's latecomer advantage in a globalized world. This should not be mistaken for vertical progress.",
            "username": "kylecyuan",
            "num_likes": 127,
            "num_retweets": 25,
            "num_replies": 1
        },
        "1036461388321894400": {
            "id": "1036461388321894400",
            "text": "8/ Much like \"Made in China 2025,\" China once aimed to be a leader in semiconductor, hardware, and software in the 1980s. However, China is still dependent on IP import and manufacturing export. It's years behind R&D input from Japan and South Korea. Why?",
            "username": "kylecyuan",
            "num_likes": 71,
            "num_retweets": 10,
            "num_replies": 2
        },
        "1036461386807762944": {
            "id": "1036461386807762944",
            "text": "7/ Many abstracted from @mattturck AI report—where he noted China AI is \"playing at a different level\" with financing and data collecting—as China having a \"nation edge\" with Frontier Tech. State-sponsored capitalism as a catalyst innovation has been mythologized.",
            "username": "kylecyuan",
            "num_likes": 71,
            "num_retweets": 7,
            "num_replies": 3
        },
        "1036461385905913856": {
            "id": "1036461385905913856",
            "text": "6/ For many in Silicon Valley, \"Made in China 2025\" is promising. China understands the vision of innovation. The corollary to vision is execution. Are China's prevailing system and institutional framework conducive to innovation? \n\nThe answer is more no than an emphatic yes.",
            "username": "kylecyuan",
            "num_likes": 74,
            "num_retweets": 11,
            "num_replies": 4
        },
        "1036461385062838274": {
            "id": "1036461385062838274",
            "text": "5/ China's \"Made in China 2025\":\n    1. Upgrade industry.\n    2. Utilize Private Markets: Strengthen IP and position in global markets.\n    3. Focus on advanced Information Tech (like AI, VR, AV), aerospace, maritime,         energy, power, agriculture, materials, and biopharma.",
            "username": "kylecyuan",
            "num_likes": 72,
            "num_retweets": 6,
            "num_replies": 2
        },
        "1036461384228171776": {
            "id": "1036461384228171776",
            "text": "4/ China is focused on economic transition: from exports,  forced industry investments, and low-skilled manufacturing, to domestic consumption and \"fast sector\" production through talent, finance, market conditions, and government support. (cc Schumpeter's Development Theory.)",
            "username": "kylecyuan",
            "num_likes": 76,
            "num_retweets": 8,
            "num_replies": 2
        },
        "1036461382273708032": {
            "id": "1036461382273708032",
            "text": "3/ Software bends the cost-curve downwards, improving productivity and economic growth. @pmarca brilliantly noted to @karaswisher \"slow\" (no software) versus \"fast\" (with software) sectors. The US says \"There are no more jobs!\" But should be saying: \"There are not enough jobs!\"",
            "username": "kylecyuan",
            "num_likes": 97,
            "num_retweets": 7,
            "num_replies": 3
        },
        "1036461381401235456": {
            "id": "1036461381401235456",
            "text": "2/ The conventional attitude towards China: invest in the promises of today but ignore the risk. Consumption, global trade, and technological innovation are the promises. Excessive debt, frothy markets, Ponzi-like financial structures, bureaucracy, and opacity are the risks.",
            "username": "kylecyuan",
            "num_likes": 125,
            "num_retweets": 25,
            "num_replies": 2
        },
        "1036460158119858176": {
            "id": "1036460158119858176",
            "text": "It’s back in stock. I liked @eladgil blogs. But here’s me organizing to put High Growth Handbook on the top bookshelf. The book’s brevity, clarity, and *immediate utility* make it a classic. Crowd intelligence at work. I bought a few-one for my founders who just closed the seed.pic.twitter.com/XWMqjDwUE2 – at Madison Ave",
            "username": "kylecyuan",
            "num_likes": 44,
            "num_retweets": 4,
            "num_replies": 0
        },
        "1034765625107906560": {
            "id": "1034765625107906560",
            "text": "15/ Cycles are dynamic to the evolutionary environment. \n\nThe Great Modulation was a period when the Federal Reserve modulated activity and muted volatility for steady returns. Then 2008 happened. \n\nChange and evolution are inevitable.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1034765623748964352": {
            "id": "1034765623748964352",
            "text": "14/ The point is that the convergence of the market into an ideal stationary state or equilibrium is wrong. Homo Sapiens evolve at the speed of thought. Selection works beyond genes, but ideas. Research the very dynamic history of hedge fund strategies.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034765622507397121": {
            "id": "1034765622507397121",
            "text": "13/ Competition, cooperation, and equilibria dynamics are adaptations. Contextualized to specific environmental challenges and market environments, AMH integrates behavioral biases to fill the holes of EMH.",
            "username": "kylecyuan",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034765620766801921": {
            "id": "1034765620766801921",
            "text": "12/ The Black-Scholes/ Merton option pricing model is the solution to the heat equation.  How does this relate to the market?\n\nYou should follow Andrew Lo's journey from EMH, Psychology, AI, Neuroscience,  Darwin, to AMH.",
            "username": "kylecyuan",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034765619487498241": {
            "id": "1034765619487498241",
            "text": "11/ Real world economic phenomena share more with evolutionary biology than physics. This seems intuitive. \n\nBiology and economic together better mirror complex adaptive systems than Newtonian physics, e.g. the three-body problem of classical mechanics.",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 2,
            "num_replies": 2
        },
        "1034765617847590917": {
            "id": "1034765617847590917",
            "text": "10/ Second, the theory of evolution applies to financial markets as it does to human behavior. Mutation, competition, and survival are reflective in markets. The oscillating nature of the markets is not pathology, but \"maladaptive.\"",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034765605923180544": {
            "id": "1034765605923180544",
            "text": "3/ Economics suffer from Physics Envy. A false sense of mathematical precision. This embodies the ivory tower disposition in the worst parts of academia. (Highlight: worst, not all).\n\nHomo Economicus is not Homo Sapiens.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1034729523303120897": {
            "id": "1034729523303120897",
            "text": "13/ Today, Buffet's idea seems apocryphal. His success is no secret. Yet, academia disregards Graham-Doddsville. Few papers exist.\n\nSharpe mocked buffet and Charlie as a \"3-sigma event.\" To which Charlie noted, we are \"6-sigma of skill.\"",
            "username": "kylecyuan",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1034729521860300800": {
            "id": "1034729521860300800",
            "text": "12/ Most, the Behavioral Advantages of Buffet and Munger generate Berkshire's alpha. From the Circle of Competence to Contrarian thought, this is the intersection of psychology and economics for value investing.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729520912375808": {
            "id": "1034729520912375808",
            "text": "11/ CAPM, BAB, and QMJ also don't account for Charlie Munger.  Or the Asset Allocation and Subsidiaries that explain Buffet's alpha, especially as Berkshire Hathaway has reached scale.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729519905693697": {
            "id": "1034729519905693697",
            "text": "10/ Berkshire Hathaway's genius insurance float model highlights the unquantifiable of Buffet's Alpha. Their underwriting model should be replicated in other ways that involve creativity.\n\nInvestors need an edge.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729518781673472": {
            "id": "1034729518781673472",
            "text": "9/ @WarrenBuffett 's leverage illustrates one of the many weaknesses of CAPM. Real-world constraints to leverage existing. CAPM assumes unlimited freedom in adjusting risk and return profiles.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729517741481984": {
            "id": "1034729517741481984",
            "text": "8/  AQR doesn't detract from Buffet's performance. With accounting (GAAP), it does, however, overestimate Buffet's leverage. GAAP considers puts as leverage. For value investors, puts are part of a Margin of Safety strategy.\n\nLeverage also doesn't sustain long-term returns.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729516797755393": {
            "id": "1034729516797755393",
            "text": "7/ \"Buffet's Alpha: A Behavioral Response (2017) argues the Behavioral thesis about the failures of CAPM in greater detail. To continue adding more factors to the CAPM (now Six Factor CAPM) is motion, not progress.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729515833085953": {
            "id": "1034729515833085953",
            "text": "6/ AQR's analysis on the Oracle of Omaha assumes truth in the EMH.  The Capital Asset Pricing Model (CAPM) produced by EMH cannot explain the behavioral and intangible catalysts that generate Buffet's alpha.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729514847428608": {
            "id": "1034729514847428608",
            "text": "5/ Standard academic factors cannot explain Buffet's performance. The authors add the variables BMB (Betting-Against-Beta) and (Quality-Minus-Junk) QMJ to explain Buffet's alpha. \n\nThe article is high-level, commendable, and impressive. But it does not explain Buffet's alpha.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729513744248834": {
            "id": "1034729513744248834",
            "text": "4/ AQR published Buffet's Alpha in 2013. It asserts the Oracle of Omaha generates alpha by investing in low beta stocks, high-quality stocks at a discount.  Returns are enhanced via low-cost leverage.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729512771178496": {
            "id": "1034729512771178496",
            "text": "3/ The Efficient-Market-Hypothesis (EMH)  states an asset's price reflects all information. With EMH, prices take a Random Walk, so predictions are futile. This drives a multi-trillion dollar index fund industry.",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729511743578112": {
            "id": "1034729511743578112",
            "text": "2/ Both articles reflect a historical debate on demand efficiency. Every investor should have a position on this, but the discussion gets little coverage. It's been nice revisiting \"Buffet's Alpha.\"",
            "username": "kylecyuan",
            "num_likes": 0,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034729510518833153": {
            "id": "1034729510518833153",
            "text": "1/ A new version of \"Buffet's Alpha\" (2013) will be published in the Financial Analysts Journal. Version 2.0, unfortunately, does not answer the claims in \"Buffet's Alpha: A Behavioral Response (2017).\"",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1034532977395617793": {
            "id": "1034532977395617793",
            "text": "17/ I read @benthompson  great read today on Uber and Bundles. Snapchat should study this too. We are entering the age of the competition between networked markets.  New innovation and strategies will be created and tested. Let's see who survives, and thrives. All exciting.",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532975420076032": {
            "id": "1034532975420076032",
            "text": "16/ One would argue that social platforms are not a zero-sum game, but a multimarket oligopoly, not winner-take-all. \"Instagram and Snapchat can co-exist!\" This is the not the logic of an innovator. One has to understand Facebook's dominant market position.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532974409199619": {
            "id": "1034532974409199619",
            "text": "15/ A duplicate Instagram—one that is appropriately executed—gives them more strategic leverage and modularity. It's that simple.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532972723093504": {
            "id": "1034532972723093504",
            "text": "14/  Instagram is saturated with feeds and pages; stories ameliorated this. But followers‚ likes, comments, and shallowness will always be core to the business. Snapchat should leverage its leadership position in specific features—AR, GeoMaps, and Filters—to duplicate Instagram.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 2
        },
        "1034532971594870785": {
            "id": "1034532971594870785",
            "text": "13/ While Instagram is a fantastic product, maybe one that co-exists with Snapchat, it's not without its flaws. It is most definitely still considered \"highlight\" social media and why Kevin Synstrom is actively innovating—the new College groups feature and Instagram TV.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532970512695297": {
            "id": "1034532970512695297",
            "text": "12/ Strategic complements are compelling in an era of networked economies. Networks and software are boundless, not fixed. Strategic complements also happen to be Porter's 6 (forgotten) Force—the one most applicable to competitive strategy in the Digital Age.",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532969015390208": {
            "id": "1034532969015390208",
            "text": "11/ If one could only use Snapchat or Instagram, the winner is now clearly Instagram. The converse is false and is troubling for Snapchat. Many saw stories as a defensive maneuver, but it has become a profitable canvas to create and capture new value.",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532967882928128": {
            "id": "1034532967882928128",
            "text": "10/ What Facebook understands and guides their fast, innovative ethos is Network Effects—the new moats, but the new way to die. Convex growth can result in concave decay.\n\nRIP MySpace and Blackberry.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1034532966662381570": {
            "id": "1034532966662381570",
            "text": "9/ Mark avoided the desire to vertically integrate with Zynga—which was acquired by Myspace—in favor of modularity. This has offered Facebook incredible leverage in WhatsApp, Instagram, and Snaptu. Mark has also sustained innovation in the existing product.",
            "username": "kylecyuan",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532964925878274": {
            "id": "1034532964925878274",
            "text": "8/ Censorship and Data Sovereignty issues aside,  Mark is a visionary CEO. Facebook has not only avoided the \"Innovator's Dilemma,\" but has created breakthrough innovations by mastering Strategic M&A in the age of networks.",
            "username": "kylecyuan",
            "num_likes": 4,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532963206275073": {
            "id": "1034532963206275073",
            "text": "7/ Snapchat needs to create better strategic complements as Facebook has done. It's possible to do this without cannibalizing Snapchat's business—and there are little other options. They need optionality. Learn from Facebook.",
            "username": "kylecyuan",
            "num_likes": 3,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532962019274752": {
            "id": "1034532962019274752",
            "text": "6/ With their dependency on advertising revenue (with limited space on the platform left to monetize), a variable endogenous primarily to engagement and growth, Snapchat needs to diversify its currently fragile strategy substantially.",
            "username": "kylecyuan",
            "num_likes": 1,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532960198909952": {
            "id": "1034532960198909952",
            "text": "5/  Engagement is central to the vibrancy of all social platforms. Conventional Wisdom disregarded Snapchat for \"sexting,\" but engagement numbers made @jeremyliew and @benchmark see something else.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532958533836800": {
            "id": "1034532958533836800",
            "text": "4/ The success of Instagram stories proves that ephemerality is a feature. Snapchat's first-mover advantage with ephemerality is transient. Ephemeral photos, filtered photos, and gasified photos. Thank you, mobile.",
            "username": "kylecyuan",
            "num_likes": 4,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532957191581696": {
            "id": "1034532957191581696",
            "text": "3/  Their woes are attributed to Instagram stories and Snapchat themselves—characterized by lackluster execution and innovation. From Spectacles to the update that cost them 3 million users.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 1,
            "num_replies": 1
        },
        "1034532955715186689": {
            "id": "1034532955715186689",
            "text": "2/ Q2 earning report features two red flags: stagnant growth and declining user engagement. As a result, Snapchat's desire for profitability, growth, and long-term market position against Facebook is jeopardized.",
            "username": "kylecyuan",
            "num_likes": 2,
            "num_retweets": 0,
            "num_replies": 1
        },
        "1034532954549170176": {
            "id": "1034532954549170176",
            "text": "1/ Back from a social media hiatus, I noticed all my friends are using Instagram stories, not Snapchat. Looking over Snapchat's Q2 earnings, the situation for Snapchat is more serious than some might imagine.",
            "username": "kylecyuan",
            "num_likes": 11,
            "num_retweets": 4,
            "num_replies": 1
        },
        "1033930973115764736": {
            "id": "1033930973115764736",
            "text": "The Sovereign Individual. I have read this book more than a few times to not only gain clarity and focus on the future but utilize it as a template to create new ideas.pic.twitter.com/vC8nA3AHAo – at Central Park West",
            "username": "kylecyuan",
            "num_likes": 5,
            "num_retweets": 0,
            "num_replies": 0
        },
        "1022137168028950530": {
            "id": "1022137168028950530",
            "text": "“Rather than bet on a layer, investors will need to pick winners in each layer.” ⁦@jeremysliew⁩ ⁦⁩ -nice article that just published + equally excellent tweet feature ⁦@ricburton⁩. REMINDER: “Fat Protocols” is not an investment thesis.https://medium.com/lightspeed-venture-partners/fat-protocols-vs-fat-dapps-vs-fat-wallets-4d33ead29130?source=twitterShare-2e394374be57-1532531257 …",
            "username": "kylecyuan",
            "num_likes": 10,
            "num_retweets": 2,
            "num_replies": 1
        }
    },
    "num_retweets_by_originator": {
        "mattdlockyer": 1
    },
    "users_retweeted": [
        "mattdlockyer"
    ]
}